uhnp/src/InformationRegisters/ОбъектыИнтегрированныеС1СДокументооборотом/ОбъектыИнтегрированныеС1СДокументооборотом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыИнтегрированныеС1СДокументооборотом</name>
  <attributes>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъектаДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбъектаДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ОбъектыИнтегрированныеС1СДокументооборотом/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОбъектыИнтегрированныеС1СДокументооборотом.ДополнительныеДанные КАК ДополнительныеДанные
		|ИЗ
		|	РегистрСведений.ОбъектыИнтегрированныеС1СДокументооборотом КАК ОбъектыИнтегрированныеС1СДокументооборотом
		|ГДЕ
		|	ОбъектыИнтегрированныеС1СДокументооборотом.Объект = &Объект
		|	И ОбъектыИнтегрированныеС1СДокументооборотом.ТипОбъектаДО = &ТипОбъектаДО
		|	И ОбъектыИнтегрированныеС1СДокументооборотом.ИдентификаторОбъектаДО = &ИдентификаторОбъектаДО");
	Запрос.УстановитьПараметр("ИдентификаторОбъектаДО", Запись.ИдентификаторОбъектаДО);
	Запрос.УстановитьПараметр("Объект", Запись.Объект);
	Запрос.УстановитьПараметр("ТипОбъектаДО", Запись.ТипОбъектаДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ТипЗнч(Выборка.ДополнительныеДанные) = Тип("ХранилищеЗначения") Тогда
			СтруктураДанных = Выборка.ДополнительныеДанные.Получить();
			Если ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда
				МассивСтрок = Новый Массив;
				Для Каждого Элемент Из СтруктураДанных Цикл
					МассивСтрок.Добавить(СтрШаблон("%1:   %2", Элемент.Ключ, СокрЛП(Элемент.Значение)));
				КонецЦикла;
				ДополнительныеДанные = СтрСоединить(МассивСтрок, Символы.ПС);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ДополнительныеДанные.Видимость = ЗначениеЗаполнено(ДополнительныеДанные);
	
КонецПроцедуры

#КонецОбласти
